xmlsamples/PI_MTCN/FR-FI-BIS.xml

<soapenv:Envelope xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <xrsi:esp-fee-inquiry-request>
         <partner>
            <id>WGBSQAH010T</id>
            <system>
               <id>WGBSQAH010T</id>
               <name>QNB</name>
               <version>9101</version>
               <ip_address>172.31.19.212</ip_address>
               <connector>
                  <id>QAH01ETW01A</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>Online</id>
            <type>WEB</type>
         </device>
         <external_reference_no>1</external_reference_no>
         <sender>
            <name>
               <first_name>SCRAMBLEPRX</first_name>
               <last_name>HASSAN I M ALIBRAHIM</last_name>
            </name>
            <address>
               <addr_line1>ADDRESS2</addr_line1>
               <addr_line2>ADDRESS3-</addr_line2>
               <city>ADDRESS3</city>
               <postal_code>ZIPNO</postal_code>
            </address>
            <preferred_customer/>
            <mobile_phone>
               <phone_number>
                  <country_code/>
                  <national_number/>
               </phone_number>
            </mobile_phone>
            <notification_preference>NONE</notification_preference>
            <notification_language>EN</notification_language>
            <sms_notification_flag>N</sms_notification_flag>
         </sender>
         <receiver>
            <name>
               <first_name>new</first_name>
               <middle_name>sit</middle_name>
               <last_name>build</last_name>
            </name>
         </receiver>
         <transaction_type>WMN</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>95000</principal_amount>
               <currency_iso_code>QAR</currency_iso_code>
               <country_iso_code>QA</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>0</expected_payout_amount>
               <currency_iso_code>EUR</currency_iso_code>
               <country_iso_code>FR</country_iso_code>
            </destination>
            <promotion/>
            <taxes/>
            <fees/>
            <message_charges/>
         </payment_details>
      </xrsi:esp-fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>